Repository: common-repository/access-category-password
Catalog: access-category-password-*.po
Languages: fr_fr

source: Access Category Password Options
fr_fr: Options d'Access Category Password

source: Save Changes
fr_fr: Enregistrer les modifications

source: The protection type
fr_fr: Le type de protection

source: Cookie expiration
fr_fr: Expiration du cookie

source: The password
fr_fr: Le mot de passe

source: Impacted categories
fr_fr: Les catégories impactées

source: Granting users
fr_fr: Utilisateurs autorisés

source: Only single post
fr_fr: Uniquement les articles

source: Display excerpt before password form
fr_fr: Afficher un extrait avant le champ de mot de passe

source: Info message
fr_fr: Message informatif

source: Input placeholder
fr_fr: Texte de remplacement du champ mot de passe

source: Error message
fr_fr: Message d'erreur

source: The validation button text
fr_fr: Le texte du bouton de validation

source: Styling the form
fr_fr: Style du formulaire

source: The feed item description text
fr_fr: La description de l'élément de flux

source: Here you can set the options of Access Category Password plugin. Set a password, check the categories with restricted access (the posts in these categories will require a password authentication), check the users roles that don't need authentification to access these categories and define some strings used to inform the user on frontend page.
fr_fr: Ici vous pouvez définir les options du plugin Access Category Password (Accès catégorie par mot de passe). Définissez un mot de passe, indiquez les catégories à protéger (les articles de ces catégories nécessiteront une identification par mot de passe pour être consultés), les utilisateurs qui pourront accéder à ces catégories sans authentification et modifiez les messages informatifs affichés sur la page Web.

source: Way used to protect
fr_fr: La façon de protéger

source: Sesssion
fr_fr: Session

source: You can choose wich way you want to use to protect the categories. <code>Session</code> is recommended but doesn't work when you're caching the content of your blog (using for example <a target="_blank" href="https://fr.wordpress.org/plugins/search/cache/">these caching plugins</a>), you need to reenter the password each time you launch your browser, this is the <strong>safer</strong> process. <code>Cookie</code> will always work, you don't need to type the password each time you want to access to the resource, but this is the <strong>less secure</strong> way.
fr_fr: Vous pouvez choisir le moyen utilisé pour protéger vos catégories. <code>Session</code> est recommandé mais ne fonctionne pas lorsque vous faites appel à un système de cache (en utilisant par exemple <a target="_blank" href="https://fr.wordpress.org/plugins/search/cache/">ces plugins d'optimisation</a>), vous devez indiquer le mot de passe à chaque fois que vous relancez votre navigateur, mais c'est le moyen le <strong>plus sûr</strong>. <code>Cookie</code> fonctionnera toujours, vous n'aurez pas à saisir à chaque fois le mot de passe pour accéder aux ressources mais est <strong>moins sûr</strong>.

source: Expiration time of the cookie
fr_fr: Le délai d'expiration du Cookie

source: 1 month
fr_fr: 1 mois

source: 3 months
fr_fr: 3 mois

source: 6 months
fr_fr: 6 mois

source: 1 year
fr_fr: 1 an

source: 2 years
fr_fr: 2 ans

source: 4 years
fr_fr: 4 ans

source: 10 years
fr_fr: 10 ans

source: Time after first set the Cookie will expire.
fr_fr: Le délai à partir de la création du cookie avant expiration.

source: Password
fr_fr: Mot de passe

source: You can type a string or a sentence, or whatever you want. If not set, the default password is <strong>acpwdpass</strong>.
fr_fr: Vous pouvez saisir une série de lettres/chiffres, une phrase, ou tout autre chose, cela n'a pas d'importance. Si vous n'en définissez pas, le mot de passe par défaut est : <strong>acpwdpass</strong>.

source: Check the categories that you want to have password restricted post access.
fr_fr: Cochez les catégories que vous souhaitez protéger.

source: Administrator
fr_fr: Administrateur

source: Editor
fr_fr: Éditeur

source: Author
fr_fr: Auteur

source: Contributor
fr_fr: Contributeur

source: Subscriber
fr_fr: Abonné

source: Check the users roles granted to access the protected categories ressources without having to provide the password.
fr_fr: Cocher les rôles des utilisateurs pouvant accéder aux resssources des catégories protégées sans s'authentifier.

source: Only hide the content of the single posts
fr_fr: Ne masquer que le contenu des articles complets

source: Check this if you only want to hide the content of the single post view. This will allow to display excerpt and content of protected posts on other pages like category, homepage, search, and so on&hellip;
fr_fr: Cochez ceci afin de ne masquer que les articles complets. Cela vous permet d'afficher les extraits et contenus d'articles protégés sur d'autres pages telles que les catégories, la page d'accueil, la page de recherche, etc&hellip;

source: Add a customized excerpt before password form
fr_fr: Ajouter un extrait personnalisé avant le champ de mot de passe

source: containing the
fr_fr: contenant les

source: first words and ending with
fr_fr: premiers mots et se terminant par

source: Check this if you want to show a costumized post excerpt before the password form. You can set the length (in words) of this excerpt and the string that should display at the end.
fr_fr: Cochez cette case si vous souhaitez faire afficher un extrait personnalisé avant le champ de mot de passe. Vous pouvez définir la longueur de l'extrait (en mots) et ce qui sera affiché en fin d'extrait.

source: This content has restricted access, please type the password below and get access.
fr_fr: Ce contenu est protégé, veuillez indiquer le mot de passe ci-dessous pour y accéder.

source: The message displayed before the password form of the protected resource (HTML formating with allowed tags).
fr_fr: Le message affiché avant le formulaire de demande de mot de passe (formatage HTML possible avec les balises autorisées).

source: Allowed tags:
fr_fr: Balises autorisées :

source: The placeholder displayed in the Password field on page load (HTML formating not allowed).
fr_fr: Le texte de remplacement affiché dans le champ du mot de passe au chargement de la page (formatage HTML non autorisé).

source: Sorry, but this is the wrong password.
fr_fr: Désolé, mais ceci est le mauvais mot de passe.

source: The message that will display if the user typed the wrong password (HTML formating with allowed tags).
fr_fr: Le message qui s'affichera lorsque l'utilisateur saisira le mauvais mot de passe (formatage possible avec balises autorisées).

source: Get access
fr_fr: Accéder

source: The validation button text to submit the entered password (HTML formating not allowed).
fr_fr: Le texte du bouton de validation permettant de soumettre le mot de passe (pas de formatage HTML possible).

source: You can style the form that replace the content of a protected article by using the <strong style="color: #0073AA">classes</strong> you can see in the code below:
fr_fr: Vous pouvez définir le style du formulaire qui remplace le contenu d'un article en utilisant les <strong style="color: #0073AA">classes</strong> ci-dessous.

source: Below the css you can change to fit to your blog styling.
fr_fr: Ci-dessous le coe css que vous pouvez modifier afin de vous conformer au style de votre blog.

source: Access to this post restricted, please go to the website to read it.
fr_fr: L'accès à cet article est protégé, veuillez vous rendre au site pour le lire. Merci.

source: The feed item descriptions that belong to access restricted posts will be replaced by this sentence (HTML formating not allowed).
fr_fr: La description de l'élément de flux qui correspond à des articles protégés sera remplacé par cette phrase (pas de formatage HTML possible)
